Revit 2024 API
CapitalizationForLoadNames Enumeration
 Enumerated type listing the options for how electrical load names should be capitalized.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum CapitalizationForLoadNames
Visual Basic
Public Enumeration CapitalizationForLoadNames
Visual C++
public enum class CapitalizationForLoadNames
Members
Member name | Description
SourceParameters |  Use the capitalization formatting taken from the parameters that create the load name (Revit 2011 and previous).
Initial |  Capitalize the first letter of each word in the load name.
Sentence |  Capitalize only the first letter of the first word in the load name.
Upper |  Capitalize all letters of every word in the load name.
See Also
Autodesk.Revit.DB.Electrical Namespace